nxp-appcodehub/dm-mcxn947-click-shield-ping-pong-game/board/pin_mux.c
    const port_pin_config_t port2_3_pin = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as PIO4_1 */
                                                    kPORT_MuxAlt0,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT4_1 (pin P2) is configured as PIO4_1 */
    PORT_SetPinConfig(PORT2, 3U, &port2_3_pin);
}

void BOARD_InitINT2_I2C_Pin(void)
{
	const port_pin_config_t INT2_I2C_PIN = {/* Internal pull-up/down resistor is disabled */
											 kPORT_PullDisable,
											 /* Low internal pull resistor value is selected. */
											 kPORT_LowPullResistor,
											 /* Fast slew rate is configured */
											 kPORT_FastSlewRate,
											 /* Passive input filter is disabled */
											 kPORT_PassiveFilterDisable,
											 /* Open drain output is disabled */
											 kPORT_OpenDrainDisable,
											 /* Low drive strength is configured */
											 kPORT_LowDriveStrength,
											 /* Pin is configured as FC4_P0 */
											 kPORT_MuxAsGpio,
											 /* Digital input enabled */
											 kPORT_InputBufferEnable,
											 /* Digital input is not inverted */
											 kPORT_InputNormal,
											 /* Pin Control Register fields [15:0] are not locked */
											 kPORT_UnlockRegister};

	PORT_SetPinConfig(PORT0, 29U, &INT2_I2C_PIN);
}

void BOARD_InitRST2_I2C_Pin(void)
{
    CLOCK_EnableClock(kCLOCK_Port0);
	const port_pin_config_t RST2_I2C_PIN = {/* Internal pull-up/down resistor is disabled */
											 kPORT_PullDisable,
											 /* Low internal pull resistor value is selected. */
											 kPORT_LowPullResistor,
											 /* Fast slew rate is configured */
											 kPORT_FastSlewRate,
											 /* Passive input filter is disabled */
											 kPORT_PassiveFilterDisable,
											 /* Open drain output is disabled */
											 kPORT_OpenDrainDisable,
											 /* Low drive strength is configured */
											 kPORT_LowDriveStrength,
											 /* Pin is configured as FC4_P0 */
											 kPORT_MuxAsGpio,
											 /* Digital input enabled */
											 kPORT_InputBufferEnable,
											 /* Digital input is not inverted */
											 kPORT_InputNormal,
											 /* Pin Control Register fields [15:0] are not locked */
											 kPORT_UnlockRegister};

	PORT_SetPinConfig(PORT0, 22U, &RST2_I2C_PIN);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
